돌의내구도 = [1, 2, 1, 4]
독 = [{
    "이름" : "루비독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "4",
    },{
    "이름" : "피치독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "3",
    },{
    "이름" : "씨-독",
    "나이" : "72년생",
    "점프력" : "2",
    "몸무게" : "1",
    },{
    "이름" : "코볼독",
    "나이" : "59년생",
    "점프력" : "1",
    "몸무게" : "1",
    },
]

def solution (독, 돌의내구도):
    
    for 강아지 in 독:
        위치 =0
        flag = True
        while(True):
            
            위치+=int(강아지["점프력"])
            print(위치, 강아지)
            
            if(위치>len(돌의내구도)):
                break
            
            돌의내구도[위치-1] -= int(강아지["몸무게"])
            
            if(돌의내구도[위치-1]<0):
                돌의내구도[위치-1]=0
                flag = False
                break
        if(flag):
            print(강아지["이름"])

solution = solution(독, 돌의내구도)

